InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/_ВзаиморасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>_ВзаиморасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоИнвойсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоИнвойсам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте инвойса закупки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>валюта инвойса закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МестоХраненияПрикрепленныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МестоХраненияПрикрепленныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийДисковыйРесурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВКД_ДополнительныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВКД_ДополнительныеЗатраты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СкладыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СкладыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
// © Primus1C  25.06.2023  НАЧАЛО ►

// Выводит сообщение об ошибке заполнения поля.
//
Процедура СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, ИмяТабличнойЧасти = Неопределено, НомерСтроки = Неопределено, Поле = Неопределено, Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		Сообщение.Поле = ИмяТабличнойЧасти + "[" + (НомерСтроки - 1) + "]." + Поле;
	ИначеЕсли ЗначениеЗаполнено(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Сообщение.УстановитьДанные(ЭтотОбъект);
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры // СообщитьОбОшибке()

Процедура УстановитьДоступностьРеквизитов(Форма, МассивДоступныхРеквизитов) Экспорт

	Для каждого Элемент Из Форма.Элементы Цикл
		Если МассивДоступныхРеквизитов.Найти(Элемент.Имя) = Неопределено Тогда
			Тип = ТипЗнч(Элемент);
			Если Тип = Тип("ПолеФормы") Тогда
				Элемент.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

Функция ТекстHTMLВФорматированнуюСтроку(ТекстHTML) Экспорт
	
    ФорматированныйДокумент = Новый ФорматированныйДокумент;
    ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Новый Структура);
    Возврат ФорматированныйДокумент.ПолучитьФорматированнуюСтроку(); 
	
КонецФункции

#Область Затраты

&НаСервере                 
// 	Расчет скопирован из проц.ПередЗаписью() док-та ПриходнаяНакладная
//   Параметры:
//    Партия - СправочникСсылка.Партии - партия товара
//    ДокВызова - ДокументСсылка.РасходнаяНакладная 
//    ТолькоИтог - Булево         
//
Функция СоставЗатрат(Партия, ДокВызова, ТолькоИтог = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	мас = Новый Массив; 
	Итог = 0; 
	ИтогВал = 0;
	
	// 1. Док-ты ДопЗатраты
	
	ДокПН = Партия.Док;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приходная", 	ДокПН);	
	Запрос.УстановитьПараметр("Партия", 	Партия);	
	//Запрос.УстановитьПараметр("ДопЗатраты", Затраты.Выгрузить(,"ДокументЗатрат").ВыгрузитьКолонку(0));
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СУММА(ВКД_ДополнительныеЗатратыДокументы.СуммаНаценки) КАК СуммаНаценки,
                   |	СУММА(ВКД_ДополнительныеЗатратыДокументы.Количество) КАК Количество,
                   |	ВКД_ДополнительныеЗатратыДокументы.Ссылка КАК Ссылка
                   |ИЗ
                   |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ВКД_ДополнительныеЗатратыДокументы
                   |ГДЕ
                   |	ВКД_ДополнительныеЗатратыДокументы.Документ = &Приходная
                   |	И ВКД_ДополнительныеЗатратыДокументы.Ссылка.Проведен
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВКД_ДополнительныеЗатратыДокументы.Ссылка
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ВКД_ДополнительныеЗатратыДокументы.Ссылка.Дата
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
                   |	ПриходнаяНакладнаяТовары.Партия КАК Партия,
                   |	ПриходнаяНакладнаяТовары.СуммаЗакупки КАК СуммаЗакупки,
                   |	ПриходнаяНакладнаяТовары.Количество КАК Количество,
                   |	ПриходнаяНакладнаяТовары.Номенклатура.Вес КАК НоменклатураВес
                   |ИЗ
                   |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
                   |ГДЕ
                   |	ПриходнаяНакладнаяТовары.Ссылка = &Приходная
                   |	И ПриходнаяНакладнаяТовары.Партия = &Партия";
	Пакет = Запрос.ВыполнитьПакет();
    Выборка 	= Пакет[0].Выбрать(); 
	СтрокиПН 	= Пакет[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ВариантРаспределения = Выборка.Ссылка.ВариантРаспределения;
		ОбщаяСуммаКРаспределению = омСервер.ПересчетЗн(Выборка.СуммаНаценки, Выборка.Ссылка.Валюта, ПараметрыСеанса.БазоваяВалюта, ДокПН.Фирма, Выборка.Ссылка.Дата, 5);
		СтрокиПН.Сбросить();
		Пока СтрокиПН.Следующий() Цикл
			Если ОбщаяСуммаКРаспределению = 0 Тогда 
				ДельтаЦены = 0;
				лЕдИзм = "";
			Иначе
				Если ВариантРаспределения = 1 Тогда
					лВесоваяЧасть = СтрокиПН.СуммаЗакупки / ДокПН.Сумма * 100  ;
					лСуммаКРаспределению = ОбщаяСуммаКРаспределению * лВесоваяЧасть / 100;
					ДельтаЦены = лСуммаКРаспределению / СтрокиПН.Количество; 
					лЕдИзм = Выборка.Ссылка.Валюта;	
				ИначеЕсли ВариантРаспределения = 2 Тогда
					ДельтаЦены = ОбщаяСуммаКРаспределению / ДокПН.ВКД_Количество; 
					лЕдИзм = "шт.";
				Иначе
					ДельтаЦены = 0;
					лЕдИзм = "";
				КонецЕсли;         
			КонецЕсли; 		
			стр = стрШаблон("%1: %2 %3 / %4 %5 * %6 = %7 %3", 
									ОбщегоНазначения.ПредставлениеДокументаДляПечати(Выборка.Ссылка) + Символы.ПС, 
									Выборка.СуммаНаценки, 
									ПараметрыСеанса.БазоваяВалюта.Символ,
									Выборка.Количество, 
		                            лЕдИзм,    
									СтрокиПН.Количество,	
									Формат(ДельтаЦены, "ЧДЦ=5")
								);
			Итог = Итог + ДельтаЦены;
			Если ДокВызова <> Неопределено Тогда
				//Если ДокВызова.Валюта <> ПараметрыСеанса.БазоваяВалюта Тогда 
					ДельтаЦеныВал = омСервер.ПересчетЗн(ДельтаЦены, ПараметрыСеанса.БазоваяВалюта, ДокВызова.Валюта, ДокПН.Фирма, ДокВызова.Дата, 5);
					стр = СтрШаблон("%1 = %2 %3", 
									стр,
					                Формат(ДельтаЦеныВал, "ЧДЦ=5"),
									ДокВызова.Валюта.Символ
									);
					ИтогВал = ИтогВал + ДельтаЦеныВал;	
				//КонецЕсли;
			КонецЕсли;
			мас.Добавить(стр);		
		КонецЦикла;     
	КонецЦикла;
	
	// 2. Док-ты Отправки
	
	//ЗатратыОтправки = Документы.ПриходнаяНакладная.ЗатратыОтправки(ПрихНакладная.Инвойс, ПрихНакладная.Поставка);
     Если ЗначениеЗаполнено(ДокПН.ВКД_Инвойс) Тогда
	 
		 Запр = Новый Запрос; 
		 Запр.УстановитьПараметр("Инвойс", 		ДокПН.ВКД_Инвойс);
		 Запр.УстановитьПараметр("Поставка", 	ДокПН.Поставка);
		 Запр.УстановитьПараметр("Номенклатура",Партия.Владелец);
		 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              |	ОтправкаРаспределениеЗатрат.Ссылка КАК Ссылка,
		              |	ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
		              |	ОтправкаРаспределениеЗатрат.Номенклатура.Вес/1000 КАК ВесЕдиницы,
		              |	ОтправкаРаспределениеЗатрат.Цена КАК Цена,
		              |	ОтправкаРаспределениеЗатрат.Количество КАК Количество,
		              |	ОтправкаРаспределениеЗатрат.Вес КАК Вес,
		              |	ОтправкаРаспределениеЗатрат.Сумма КАК Сумма
		              |ИЗ
		              |	Документ.Отправка.РаспределениеЗатрат КАК ОтправкаРаспределениеЗатрат
		              |ГДЕ
		              |	ОтправкаРаспределениеЗатрат.Ссылка В
		              |			(ВЫБРАТЬ
		              |				ОтправкаИнвойсы.Ссылка
		              |			ИЗ
		              |				Документ.Отправка.Инвойсы КАК ОтправкаИнвойсы
		              |			ГДЕ
		              |				ОтправкаИнвойсы.Инвойс = &Инвойс
		              |				И ОтправкаИнвойсы.Поставка = &Поставка
		              |				И ОтправкаИнвойсы.Ссылка.Проведен)
		              |	И ОтправкаРаспределениеЗатрат.Номенклатура = &Номенклатура"; 
		 Выборка = Запр.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл
			стр = стрШаблон("%1: %2 %3 / %4 %5 * %6 %5 = %7 %3",
		            				ОбщегоНазначения.ПредставлениеДокументаДляПечати(Выборка.Ссылка) + Символы.ПС, 
									Выборка.Сумма,
									ПараметрыСеанса.БазоваяВалюта.Символ,
									Выборка.Вес,
									"кг", 
									Выборка.ВесЕдиницы,
									//Выборка.Количество,
									Выборка.Цена
						);
			Итог = Итог + Выборка.Цена;			
			Если ДокВызова <> Неопределено Тогда
				//Если ДокВызова.Валюта <> ПараметрыСеанса.БазоваяВалюта Тогда 
					ЦенаВал = омСервер.ПересчетЗн(Выборка.Цена, ПараметрыСеанса.БазоваяВалюта, ДокВызова.Валюта, ДокПН.Фирма, ДокВызова.Дата, 5);
					стр = СтрШаблон("%1 = %2 %3", 
									стр,
					                Формат(ЦенаВал, "ЧДЦ=5"),
									ДокВызова.Валюта.Символ
									);
					ИтогВал = ИтогВал + ЦенаВал;	
				//КонецЕсли;
			КонецЕсли;					
			мас.Добавить(стр);		
			 
		 КонецЦикла;
	 
	 КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	 
	 Если ТолькоИтог Тогда
	 	Возврат Новый Структура("Сумма,СуммаВал", Итог, ИтогВал);
	 Иначе
    	Возврат мас;
	 КонецЕсли;
	
КонецФункции // СоставЗатрат()

#КонецОбласти


#Область Инвойсы

////Функция СуммаКоличествоИнвойсаСУчетомКорректировок(СсылкаИнвойс) Экспорт
////	
////	Результат = Новый Структура("Количество,Сумма", 0, 0);

////	Если СсылкаИнвойс.Проведен Тогда
////		
////		ЗапрКор = Новый Запрос;
////		ЗапрКор.Текст = "ВЫБРАТЬ
////		                |	СУММА(ОтправкаИнвойсовОбороты.КоличествоОборот) КАК Количество,
////		                |	СУММА(ОтправкаИнвойсовОбороты.СуммаОборот) КАК Сумма,
////		                |	ОтправкаИнвойсовОбороты.Инвойс
////		                |ИЗ
////		                |	РегистрНакопления.ОтправкаИнвойсов.Обороты КАК ОтправкаИнвойсовОбороты
////		                |ГДЕ
////		                |	ОтправкаИнвойсовОбороты.Инвойс = &Инвойс
////		                |
////		                |СГРУППИРОВАТЬ ПО
////		                |	ОтправкаИнвойсовОбороты.Инвойс"; 
////		ЗапрКор.УстановитьПараметр("Инвойс", СсылкаИнвойс);
////		Выборка = ЗапрКор.Выполнить().Выбрать();
////		Если Выборка.Следующий() Тогда
////			Результат.Вставить("Количество", Выборка.Количество);
////			Результат.Вставить("Сумма", Выборка.Сумма);
////		КонецЕсли;	
////	
////	ИначеЕсли НЕ СсылкаИнвойс.ПометкаУдаления Тогда
////	
////		Результат.Вставить("Количество", СсылкаИнвойс.ВКД_Товары.Итог("Количество"));
////		Результат.Вставить("Сумма", СсылкаИнвойс.ВКД_Товары.Итог("СуммаЗакупки"));
////	
////	КонецЕсли;
////	
////	Возврат Результат;

////КонецФункции 
//	
//Функция ИнвойсПоИнвойсуЗакупки(СсылкаИнвойсЗакупки)

//	Запр = Новый Запрос;
//	Запр.УстановитьПараметр("ДокументОснование", СсылкаИнвойсЗакупки);
//	Запр.Текст = "ВЫБРАТЬ
//	             |	_Инвойс.Ссылка КАК Ссылка
//	             |ИЗ
//	             |	Документ._Инвойс КАК _Инвойс
//	             |ГДЕ
//	             |	_Инвойс.ДокументОснование = &ДокументОснование
//	             |	И _Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Товар)
//	             |
//	             |УПОРЯДОЧИТЬ ПО
//	             |	_Инвойс.ПометкаУдаления";
//	Выборка = Запр.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Ссылка;	
//	Иначе	
//	    Возврат Документы._Инвойс.ПустаяСсылка();
//	КонецЕсли;

//КонецФункции // ИнвойсПоИнвойсуЗакупки()

//Функция ИнвойсыИерархии(СсылкаИнвойс)
//	
//	ИнвойсыИерархии = Новый Массив;
//	
//	Если ТипЗнч(СсылкаИнвойс) = Тип("ДокументСсылка._Инвойс") Тогда
//		Если ЗначениеЗаполнено(СсылкаИнвойс.ДокументОснование) Тогда
//			ДокументОснование = СсылкаИнвойс.ДокументОснование;	
//		Иначе	
//	        ДокументОснование = Неопределено;
//			ИнвойсыИерархии.Добавить(СсылкаИнвойс);
//		КонецЕсли;
//	Иначе
//		ДокументОснование = СсылкаИнвойс;	
//	КонецЕсли;	
//	
//	ЕстьУдаленные = Ложь;
//	Если ДокументОснование <> Неопределено Тогда  
//		ИнвойсыИерархии.Добавить(ДокументОснование);
//		Запр = Новый Запрос; 
//		Запр.УстановитьПараметр("ДокументОснование", ДокументОснование);
//		Запр.Текст = "ВЫБРАТЬ
//		             |	Инвойс.Ссылка,
//		             |	Инвойс.ПометкаУдаления
//		             |ИЗ
//		             |	Документ._Инвойс КАК Инвойс
//		             |ГДЕ
//		             |	Инвойс.ДокументОснование = &ДокументОснование";
//        Выборка = Запр.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл 
//			Если Выборка.ПометкаУдаления Тогда
//				ЕстьУдаленные = Истина;
//			Иначе
//				ИнвойсыИерархии.Добавить(Выборка.Ссылка);	
//			КонецЕсли;
//		КонецЦикла;	
//	КонецЕсли;	
//	
//	Возврат Новый Структура("Инвойсы,ЕстьУдаленные", ИнвойсыИерархии, ЕстьУдаленные);
//	
//КонецФункции	
//	
//// СсылкаИнвойс - документ "_Инвойс" или "ИнвойсЗакупки" 
////
//Процедура ЗаписатьСтатусыИнвойса(СсылкаИнвойс, Статус = Неопределено, СтатусИнспекции = Неопределено, СтатусОплаты = Неопределено, СтатусОплатыАвто = Неопределено, ВызовИз = Неопределено) Экспорт

//	ИнвойсыИерархии = ИнвойсыИерархии(СсылкаИнвойс);
//	
//	Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл 
//		
//		Если Не ЗначениеЗаполнено(Инвойс) Тогда
//			Продолжить;
//		КонецЕсли;     
//		
//		МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи(); 
//		МенеджерЗаписи.Инвойс = Инвойс;
//        МенеджерЗаписи.Прочитать();
//		МенеджерЗаписи.Инвойс = Инвойс;
//		
//		лСтатус = "";
//		Если Статус <> Неопределено Тогда
//			МенеджерЗаписи.Статус			= Статус;   
//			лСтатус = лСтатус + "инвойс -> " + ?(МенеджерЗаписи.Статус=Перечисления.СтатусыИнвойса.ПустаяСсылка(), "пусто", МенеджерЗаписи.Статус) + ", ";
//		КонецЕсли;
//		Если СтатусИнспекции <> Неопределено Тогда
//			МенеджерЗаписи.СтатусИнспекции	= СтатусИнспекции;   
//			лСтатус = лСтатус + "инспекция -> " + МенеджерЗаписи.СтатусИнспекции + ", ";
//		КонецЕсли;
//		Если СтатусОплаты <> Неопределено Тогда
//			МенеджерЗаписи.СтатусОплаты		= СтатусОплаты;   
//			лСтатус = лСтатус + "оплата -> " + МенеджерЗаписи.СтатусОплаты + ", ";
//		КонецЕсли;
//		Если СтатусОплатыАвто <> Неопределено Тогда
//			МенеджерЗаписи.СтатусОплатыАвто	= СтатусОплатыАвто;   
//			лСтатус = лСтатус + "оплата инвойсов -> " + МенеджерЗаписи.СтатусОплатыАвто + ", ";
//		КонецЕсли;
//		МенеджерЗаписи.Записать();
//		
//		Если лСтатус = "" Тогда
//			лСтатус = "не изменены";
//		Иначе	
//			лСтатус = Лев(лСтатус, СтрДлина(лСтатус)-2);
//		КонецЕсли; 	
//		Если ЗначениеЗаполнено(ВызовИз) Тогда
//			лСтатус = лСтатус + " (вызов " + ВызовИз + ")"; 
//		КонецЕсли;
//		ЗаписьЖурналаРегистрации("Инвойс.Запись статуса инвойса", УровеньЖурналаРегистрации.Информация, Инвойс.Метаданные(), Инвойс, "Статусы: " + лСтатус);
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//// Процедура записывает в РС ресурс Расхождения
//// Инвойс - ссылка на документ "_Инвойс" или "ИнвойсЗакупки"
//Процедура ЗаписатьРасхожденияИнвойса(СсылкаИнвойс) Экспорт
//	
//	ИнвойсыИерархии = ИнвойсыИерархии(СсылкаИнвойс);
//	
//	Если ИнвойсыИерархии.Инвойсы.ВГраница() < 1 Тогда 
//		// для одного док-та не существует расхождений  
//		МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
//		МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;
//		МенеджерЗаписи.Прочитать(); 
//		МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;  
//		МенеджерЗаписи.Расхождения 	= Ложь; 
//		МенеджерЗаписи.Состояние	= 3;
//		МенеджерЗаписи.Записать();
//		гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> нет расхождений, нет связанных инвойсов", СсылкаИнвойс.Метаданные().Синоним, "Запись состояния инвойса", СсылкаИнвойс, 4);
//		Возврат;	
//	Иначе	
//		
//		Состояние = 3;  //0 - проведен, 1 - не проведен, 2 - пом.удален, 3 - нет док-та
//		ЕстьПроведенные 	= Ложь;
//		ЕстьНЕПроведенные 	= Ложь;
//		ЕстьПомеченныеНаУд	= ИнвойсыИерархии.ЕстьУдаленные;
//		Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл
//			Если ТипЗнч(Инвойс) = Тип("ДокументСсылка._Инвойс") Тогда
//				Если Инвойс.Проведен Тогда
//					ЕстьПроведенные = Истина;
//				Иначе
//					ЕстьНЕПроведенные = Ложь;
//				КонецЕсли;    
//			КонецЕсли;
//		КонецЦикла;
//		Если ЕстьПомеченныеНаУд И НЕ ЕстьПроведенные И НЕ ЕстьНЕПроведенные Тогда
//			Состояние = 2;	
//		ИначеЕсли ЕстьНЕПроведенные Тогда
//			Состояние = 1;
//		ИначеЕсли ЕстьПроведенные И НЕ ЕстьНЕПроведенные Тогда
//			Состояние = 0;
//		КонецЕсли;
//		
//		Если ТипЗнч(СсылкаИнвойс) = Тип("ДокументСсылка._Инвойс") Тогда	
//			ИнвойсЗакупки  	= СсылкаИнвойс.ДокументОснование;
//		Иначе           
//			ИнвойсЗакупки	= СсылкаИнвойс;
//		КонецЕсли;
//		
//		Запр = Новый Запрос;   
//		Запр.УстановитьПараметр("ИнвойсЗакупки", ИнвойсЗакупки);
//		Запр.Текст = "ВЫБРАТЬ
//		             |	Инвойс.Ссылка КАК Инвойс,
//		             |	СУММА(ВЫБОР
//		             |			КОГДА Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Скидка)
//		             |				ТОГДА Инвойс.СуммаВВалютеИнвойса
//		             |			ИНАЧЕ Инвойс.Сумма
//		             |		КОНЕЦ) * Инвойс.Курс КАК СуммаПересчет,
//		             |	СУММА(ВЫБОР
//		             |			КОГДА Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Товар)
//		             |					ИЛИ Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.ПустаяСсылка)
//		             |				ТОГДА Инвойс.ВКД_Количество
//		             |			ИНАЧЕ 0
//		             |		КОНЕЦ) КАК Количество
//		             |ПОМЕСТИТЬ ВсеИнвойсы
//		             |ИЗ
//		             |	Документ._Инвойс КАК Инвойс
//		             |ГДЕ
//		             |	Инвойс.ДокументОснование = &ИнвойсЗакупки
//		             |	И НЕ Инвойс.ПометкаУдаления
//		             |
//		             |СГРУППИРОВАТЬ ПО
//		             |	Инвойс.Ссылка,
//		             |	Инвойс.Курс
//		             |;
//		             |
//		             |////////////////////////////////////////////////////////////////////////////////
//		             |ВЫБРАТЬ
//		             |	_Инвойс.Контрагент <> ИнвойсЗакупки.Контрагент КАК РазнКонтрагент,
//		             |	_Инвойс.ВКД_НомерИнвойсаПоставщика <> ИнвойсЗакупки.НомерИнвойсаПоставщика КАК РазнНомерИнвойсаПоставщика,
//		             |	_Инвойс.ВКД_ДатаИнвойсаПоставщика <> ИнвойсЗакупки.ДатаИнвойсаПоставщика КАК РазнДатаИнвойсаПоставщика,
//		             |	ВсеИнвойсы.СуммаПересчет КАК Сумма,
//		             |	ВсеИнвойсы.Количество КАК Количество
//		             |ИЗ
//		             |	Документ._Инвойс КАК _Инвойс
//		             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвойсЗакупки КАК ИнвойсЗакупки
//		             |		ПО _Инвойс.ДокументОснование = ИнвойсЗакупки.Ссылка
//		             |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеИнвойсы КАК ВсеИнвойсы
//		             |		ПО (ВсеИнвойсы.Инвойс = _Инвойс.Ссылка)
//		             |ГДЕ
//		             |	_Инвойс.ДокументОснование = &ИнвойсЗакупки";  
//		РезультатЗапроса = Запр.Выполнить(); 
//		Выгрузка = РезультатЗапроса.Выгрузить();
//		Выборка = РезультатЗапроса.Выбрать(); 
//		Если Выборка.Следующий() Тогда  
//			
//			Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл 
//				
//				РазнКоличество = Выгрузка.Итог("Количество") <> ИнвойсЗакупки.Количество;
//				РазнСумма = Выгрузка.Итог("Сумма") - ИнвойсЗакупки.Сумма;
//				Если РазнСумма < 0 Тогда
//					РазнСумма = - РазнСумма;
//				КонецЕсли;
//				РазнСумма = РазнСумма > 0.9; 
//				
//				// добавление записи в РС
//				МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
//				МенеджерЗаписи.Инвойс 		= Инвойс;
//				МенеджерЗаписи.Прочитать();    
//				МенеджерЗаписи.Инвойс 		= Инвойс;
//				МенеджерЗаписи.Расхождения  = Выборка.РазнКонтрагент ИЛИ 
//												Выборка.РазнНомерИнвойсаПоставщика ИЛИ
//												Выборка.РазнДатаИнвойсаПоставщика ИЛИ
//												РазнКоличество ИЛИ
//												РазнСумма;
//				МенеджерЗаписи.Состояние 	= Состояние;											
//				МенеджерЗаписи.Записать(); 
//			
//				// Запишем лог в ЖР
//				Если МенеджерЗаписи.Расхождения Тогда
//					ИнфоЖР = "Да: ";
//					Если Выборка.РазнКонтрагент Тогда
//						ИнфоЖР = ИнфоЖР + "контрагент, "; 
//					КонецЕсли;
//					Если РазнСумма Тогда
//						ИнфоЖР = ИнфоЖР + "сумма, "; 
//					КонецЕсли;
//					Если РазнКоличество Тогда
//						ИнфоЖР = ИнфоЖР + "кол-во, "; 
//					КонецЕсли;
//					Если Выборка.РазнНомерИнвойсаПоставщика Тогда
//						ИнфоЖР = ИнфоЖР + "№ инв.поставщика, "; 
//					КонецЕсли;
//					Если Выборка.РазнДатаИнвойсаПоставщика Тогда
//						ИнфоЖР = ИнфоЖР + "дата инв.поставщика, "; 
//					КонецЕсли;
//				    ИнфоЖР = Лев(ИнфоЖР, СтрДлина(ИнфоЖР)-2);
//				Иначе
//					ИнфоЖР = "Нет"; 
//				КонецЕсли;
//				гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> " + ИнфоЖР, Инвойс.Метаданные().Синоним, "Запись состояния инвойса", Инвойс, 4);
//				
//			КонецЦикла;	
//		
//		Иначе
//			
//			// добавление записи в РС
//			МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
//			МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;
//			МенеджерЗаписи.Расхождения = Ложь;
//			МенеджерЗаписи.Записать(); 
//			гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> создание документа", СсылкаИнвойс.Метаданные().Синоним, "Запись состояния инвойса", Инвойс, 4);
//			 
//		КонецЕсли;
//	
//	КонецЕсли;

//	
//		
//		
//	//	
//	//
//	//
//	//ЗапрРасх = Новый Запрос;   
//	//ЗапрРасх.УстановитьПараметр("Инвойс", Инвойс);
//	//ЗапрРасх.УстановитьПараметр("ИнвойсЗакупки", ИнвойсЗакупки);
//	//ЗапрРасх.Текст = "ВЫБРАТЬ
//	//                 |	Инвойс.Ссылка КАК Инвойс,
//	//                 |	СУММА(Инвойс.СуммаВВалютеИнвойса) КАК СуммаВВалютеИнвойса,
//	//                 |	СУММА(ВЫБОР
//	//                 |			КОГДА Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Товар)
//	//                 |				ТОГДА Инвойс.ВКД_Количество
//	//                 |			ИНАЧЕ 0 
//	//                 |		КОНЕЦ) КАК Количество
//	//                 |ПОМЕСТИТЬ ВсеИнвойсы
//	//                 |ИЗ
//	//                 |	Документ._Инвойс КАК Инвойс
//	//                 |ГДЕ
//	//                 |	Инвойс.ДокументОснование = &ИнвойсЗакупки
//	//                 |	И НЕ Инвойс.ПометкаУдаления
//	//                 |
//	//                 |СГРУППИРОВАТЬ ПО
//	//                 |	Инвойс.Ссылка
//	//                 |;
//	//                 |
//	//                 |////////////////////////////////////////////////////////////////////////////////
//	//                 |ВЫБРАТЬ
//	//                 |	ВЫБОР
//	//                 |		КОГДА _Инвойс.Контрагент = ИнвойсЗакупки.Контрагент
//	//                 |			ТОГДА ЛОЖЬ
//	//                 |		ИНАЧЕ ИСТИНА
//	//                 |	КОНЕЦ КАК Контрагент,
//	//                 |	ВЫБОР
//	//                 |		КОГДА _Инвойс.СуммаВВалютеИнвойса = ИнвойсЗакупки.Сумма
//	//                 |			ТОГДА ЛОЖЬ
//	//                 |		ИНАЧЕ ИСТИНА
//	//                 |	КОНЕЦ КАК Сумма,
//	//                 |	ВЫБОР
//	//                 |		КОГДА _Инвойс.ВКД_НомерИнвойсаПоставщика = ИнвойсЗакупки.НомерИнвойсаПоставщика
//	//                 |			ТОГДА ЛОЖЬ
//	//                 |		ИНАЧЕ ИСТИНА
//	//                 |	КОНЕЦ КАК НомерИнвойсаПоставщика,
//	//                 |	ВЫБОР
//	//                 |		КОГДА _Инвойс.ВКД_ДатаИнвойсаПоставщика = ИнвойсЗакупки.ДатаИнвойсаПоставщика
//	//                 |			ТОГДА ЛОЖЬ
//	//                 |		ИНАЧЕ ИСТИНА
//	//                 |	КОНЕЦ КАК ДатаИнвойсаПоставщика,
//	//                 |	ВЫБОР
//	//                 |		КОГДА _Инвойс.ВКД_Количество = ИнвойсЗакупки.Количество
//	//                 |			ТОГДА ЛОЖЬ
//	//                 |		ИНАЧЕ ИСТИНА
//	//                 |	КОНЕЦ КАК Количество,
//	//                 |	ВсеИнвойсы.СуммаВВалютеИнвойса КАК ВсеСуммыИнвойсов,
//	//                 |	ВсеИнвойсы.Количество КАК ВсеКоличестваИнвойсов
//	//                 |ИЗ
//	//                 |	Документ._Инвойс КАК _Инвойс
//	//                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвойсЗакупки КАК ИнвойсЗакупки
//	//                 |		ПО _Инвойс.ДокументОснование = ИнвойсЗакупки.Ссылка
//	//                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеИнвойсы КАК ВсеИнвойсы
//	//                 |		ПО ВсеИнвойсы.Инвойс = _Инвойс.Ссылка
//	//                 |ГДЕ
//	//                 |	_Инвойс.Ссылка = &Инвойс
//	//                 |
//	//                 |УПОРЯДОЧИТЬ ПО
//	//                 |	_Инвойс.ПометкаУдаления";
//	//Пакет = ЗапрРасх.ВыполнитьПакет();
//	//Выборка = Пакет[1].Выбрать();
//	//Если Выборка.Следующий() Тогда 

//	//	// удаление записей из РС (независимо по измерениям Инвойс и ИнвойсЗакупки)
//	//	//ПрочитанныеСтатусы = Новый Структура("Статус, СтатусИнспекции, СтатусОплаты", Перечисления.СтатусыИнвойса.НеОтправлен, Неопределено, Неопределено);
//	//	//ПрочитанныеСтатусы = Новый Структура("Статус, СтатусИнспекции, СтатусОплаты", Неопределено, Неопределено, Неопределено);
//	//	//Для Сч = 1 По 2 Цикл
//	//	//	Набор = РегистрыСведений.СостоянияИнвойсов.СоздатьНаборЗаписей(); 
//	//	//	Если Сч = 1 Тогда
//	//	//		Набор.Отбор.Инвойс.Установить(Инвойс);
//	//	//	Иначе
//	//	//		Набор.Отбор.ИнвойсЗакупки.Установить(ИнвойсЗакупки);
//	//	//	КонецЕсли;
//	//	//	Набор.Прочитать();
//	//	//	Если Набор.Количество() > 0 Тогда
//	//	//		Если ЗначениеЗаполнено(Набор[0].Статус) Тогда
//	//	//			ПрочитанныеСтатусы.Статус = Набор[0].Статус;
//	//	//		КонецЕсли;	
//	//	//		Если ЗначениеЗаполнено(Набор[0].СтатусИнспекции) Тогда
//	//	//			ПрочитанныеСтатусы.СтатусИнспекции = Набор[0].СтатусИнспекции;	
//	//	//		КонецЕсли;	
//	//	//		Если ЗначениеЗаполнено(Набор[0].СтатусОплаты) Тогда
//	//	//			ПрочитанныеСтатусы.СтатусОплаты = Набор[0].СтатусОплаты;	
//	//	//		КонецЕсли;
//	//	//	КонецЕсли;
//	//	//КонецЦикла;
//	//	//Если ЗначениеЗаполнено(Инвойс) Тогда
//	//	//	Набор = РегистрыСведений.СостоянияИнвойсов.СоздатьНаборЗаписей(); 
//	//	//    Набор.Отбор.Инвойс.Установить(Инвойс);
//	//	//    Набор.Записать();
//	//	//КонецЕсли;			
//	//	//Если ЗначениеЗаполнено(ИнвойсЗакупки) Тогда
//	//	//	Набор = РегистрыСведений.СостоянияИнвойсов.СоздатьНаборЗаписей(); 
//	//	//    Набор.Отбор.ИнвойсЗакупки.Установить(ИнвойсЗакупки);
//	//	//    Набор.Записать();
//	//	//КонецЕсли;			
//	//    Набор = РегистрыСведений.СостоянияИнвойсов.СоздатьНаборЗаписей(); 
//	//    Набор.Отбор.Инвойс.Установить(Инвойс);

//	//	
//	//	// добавление записи в РС
//	//	МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
//	//	МенеджерЗаписи.Инвойс 				= Инвойс;
//	//	//МенеджерЗаписи.ИнвойсЗакупки_ 		= ИнвойсЗакупки; 
//	//	МенеджерЗаписи.Прочитать();    
//	//	МенеджерЗаписи.Инвойс 				= Инвойс;
//	//	//МенеджерЗаписи.ИнвойсЗакупки_ 		= ИнвойсЗакупки; 
//	//	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПрочитанныеСтатусы);									
//	//	Если ЗначениеЗаполнено(Инвойс) И ЗначениеЗаполнено(ИнвойсЗакупки) Тогда  
//	//		МенеджерЗаписи.Расхождения 		= 
//	//										//Выборка.ДатаОплаты ИЛИ 
//	//										Выборка.Контрагент ИЛИ 
//	//										Выборка.Сумма ИЛИ   
//	//										Выборка.Количество ИЛИ 
//	//										//Выборка.Валюта ИЛИ 
//	//										Выборка.НомерИнвойсаПоставщика ИЛИ
//	//										Выборка.ДатаИнвойсаПоставщика;
//	//	Иначе	
//	//		МенеджерЗаписи.Расхождения		= Ложь;	
//	//	КонецЕсли;											
//	//	МенеджерЗаписи.Записать(); 
//	//	
//	//	// Запишем лог в ЖР
//	//	Если МенеджерЗаписи.Расхождения Тогда
//	//		ИнфоЖР = "Да: ";
//	//		//Если Выборка.ДатаОплаты Тогда
//	//		//	ИнфоЖР = ИнфоЖР + "дата оплаты, "; 
//	//		//КонецЕсли;
//	//		Если Выборка.Контрагент Тогда
//	//			ИнфоЖР = ИнфоЖР + "контрагент, "; 
//	//		КонецЕсли;
//	//		Если Выборка.Сумма Тогда
//	//			ИнфоЖР = ИнфоЖР + "сумма, "; 
//	//		КонецЕсли;
//	//		Если Выборка.Количество Тогда
//	//			ИнфоЖР = ИнфоЖР + "кол-во, "; 
//	//		КонецЕсли;
//	//		//Если Выборка.Валюта Тогда
//	//		//	ИнфоЖР = ИнфоЖР + "валюта, "; 
//	//		//КонецЕсли;
//	//		Если Выборка.НомерИнвойсаПоставщика Тогда
//	//			ИнфоЖР = ИнфоЖР + "№ инв.поставщика, "; 
//	//		КонецЕсли;
//	//		Если Выборка.ДатаИнвойсаПоставщика Тогда
//	//			ИнфоЖР = ИнфоЖР + "дата инв.поставщика, "; 
//	//		КонецЕсли;
//	//	    ИнфоЖР = Лев(ИнфоЖР, СтрДлина(ИнфоЖР)-2);
//	//	Иначе
//	//		ИнфоЖР = "Нет"; 
//	//	КонецЕсли;
//	//	гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> " + ИнфоЖР, ИнвойсДляЖР.Метаданные().Синоним, "Запись состояния инвойса", ИнвойсДляЖР, 4);
//	//	
//	//КонецЕсли;
//	
//КонецПроцедуры

Функция СкладыКонтрагентов(Отправители = Истина, Получатели = Истина) Экспорт

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	СкладыКонтрагентов.Ссылка
	             |ИЗ
	             |	Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	             |ГДЕ
	             |	НЕ СкладыКонтрагентов.ПометкаУдаления
	             |	И НЕ СкладыКонтрагентов.Отправитель
	             |	И НЕ СкладыКонтрагентов.Получатель
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СкладыКонтрагентов.Наименование";
	Если Отправители Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, "НЕ СкладыКонтрагентов.Отправитель", "СкладыКонтрагентов.Отправитель");
	КонецЕсли;				 
	Если Получатели Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, "НЕ СкладыКонтрагентов.Получатель", "СкладыКонтрагентов.Получатель");
	КонецЕсли;				 

	Возврат Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции // СкладыКонтрагентов()

Процедура ЗаполнитьРеквизитыДокументаПоУмолчанию(ДокументОбъект, ЕстьФирма = Истина) Экспорт
	
	Если ЕстьФирма Тогда
		ДокументОбъект.Фирма 	= гоФирма();
	КонецЕсли;
	ДокументОбъект.КемСоздан 	= гоПользователь(); 
	ДокументОбъект.Создан 		= ТекущаяДатаСеанса(); 
	
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Валюта") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Валюта) Тогда 
			Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПередачаНаКомиссию") Тогда
				ДокументОбъект.Валюта = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ВалютаРасчетовСКомиссионером");		
			ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетКомиссионера") Тогда
						
			Иначе	
				ДокументОбъект.Валюта = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Склад") <> Неопределено Тогда 
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Склад) Тогда
			ДокументОбъект.Склад = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
		КонецЕсли;	 
	КонецЕсли;
	Если  ДокументОбъект.Метаданные().Реквизиты.Найти("СкладОтправитель") <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.СкладОтправитель) Тогда
			ДокументОбъект.СкладОтправитель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СкладОтправителя");
		КонецЕсли;	
	КонецЕсли;
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("СкладПолучатель") <> Неопределено Тогда   
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.СкладПолучатель) Тогда
			ДокументОбъект.СкладПолучатель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СкладПолучателя");
		КонецЕсли;	 
	КонецЕсли;

	// комиссия
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("СкладКомиссии") <> Неопределено Тогда   
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.СкладКомиссии) Тогда
			ДокументОбъект.СкладКомиссии = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СкладКомиссии");
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


// Возвращает ВидНоменклатуры с учетом иерархии 
//
Функция ВидНоменклатуры(Знач Номенклатура) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда  
		ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
		Пока Номенклатура.Уровень() > 0 Цикл
			Если ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры) Тогда
				ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
				Прервать;
			Иначе	
				Номенклатура = Номенклатура.Родитель;
			КонецЕсли;
		КонецЦикла; 
	Иначе 
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВидНоменклатуры;
	
КонецФункции // ВидНоменклатуры()


Функция ОстаткиПриходнойНакладной(ДокументСсылка) Экспорт

	Запр = Новый Запрос; 
		Запр.УстановитьПараметр("ПрихНакладная", ДокументСсылка);
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	Свод.Номенклатура КАК Номенклатура,
		             |	Свод.Серия КАК Серия,
		             |	Свод.Партия КАК Партия,
		             |	Свод.ЦенаЗакупки КАК ЦенаЗакупки,
		             |	СУММА(Свод.Количество) КАК Количество,
		             |	СУММА(Свод.СуммаЗакупки) КАК СуммаЗакупки
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ПрихНакл.Номенклатура КАК Номенклатура,
		             |		ПрихНакл.Серия КАК Серия,
		             |		ПрихНакл.Партия КАК Партия,
		             |		ПрихНакл.ЦенаЗакупки КАК ЦенаЗакупки,
		             |		ПрихНакл.Количество КАК Количество,
		             |		ПрихНакл.СуммаЗакупки КАК СуммаЗакупки
		             |	ИЗ
		             |		Документ.ПриходнаяНакладная.Товары КАК ПрихНакл
		             |	ГДЕ
		             |		ПрихНакл.Ссылка = &ПрихНакладная
		             |		И НЕ ПрихНакл.Ссылка.ПометкаУдаления
		             |	
		             |	ОБЪЕДИНИТЬ
		             |	
		             |	ВЫБРАТЬ
		             |		Перем.Номенклатура,
		             |		Перем.Серия,
		             |		Перем.Партия,
		             |		Перем.ЦенаЗакупки,
		             |		-Перем.Количество,
		             |		-Перем.СуммаЗакупки
		             |	ИЗ
		             |		Документ.Перемещение.Товары КАК Перем
		             |	ГДЕ
		             |		Перем.Ссылка.ДокументОснование = &ПрихНакладная
		             |		И НЕ Перем.Ссылка.ПометкаУдаления
		             |	
		             |	ОБЪЕДИНИТЬ
		             |	
		             |	ВЫБРАТЬ
		             |		РасхНакл.Номенклатура,
		             |		РасхНакл.Серия,
		             |		РасхНакл.Партия,
		             |		РасхНакл.ЦенаЗакупки,
		             |		-РасхНакл.Количество,
		             |		-РасхНакл.СуммаЗакупки
		             |	ИЗ
		             |		Документ.РасходнаяНакладная.Товары КАК РасхНакл
		             |	ГДЕ
		             |		РасхНакл.Ссылка.ДокументОснование = &ПрихНакладная
		             |		И НЕ РасхНакл.Ссылка.ПометкаУдаления) КАК Свод
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	Свод.Номенклатура,
		             |	Свод.Серия,
		             |	Свод.Партия,
		             |	Свод.ЦенаЗакупки
		             |
		             |ИМЕЮЩИЕ
		             |	СУММА(Свод.Количество) > 0"; 
		Возврат Запр.Выполнить().Выгрузить();

КонецФункции 


Функция ПолучитьТипКлиента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	л_ИмяПриложения = "";
	
    л_Соединения = ПолучитьСоединенияИнформационнойБазы();
	Для Каждого л_Соединение Из л_Соединения Цикл 
		Если л_Соединение.НомерСоединения = НомерСоединенияИнформационнойБазы() Тогда 
			л_ИмяПриложения = л_Соединение.ИмяПриложения;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат л_ИмяПриложения;
	
КонецФункции

Функция ПройденКонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЗначениеСсылка) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Спр.Ссылка
    |ИЗ
    |    Справочник." + ИмяОбъекта + " КАК Спр
    |ГДЕ
    |    Спр.Ссылка <> &парЗначениеСсылка
    |";     
    Нум = 0;
    Для Каждого Знч Из СтрРеквизитов Цикл
        ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
        Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе; 
        Запрос.УстановитьПараметр("Пар" + Строка(Нум),    Знч.Значение);
        Нум = Нум + 1;
    КонецЦикла;    
    Запрос.УстановитьПараметр("парЗначениеСсылка",         ЗначениеСсылка);        
    РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой(); 

КонецФункции

Функция ВременнаяТаблицаИзТаблицыЗначений(Таблица, НазваниеВременнойТаблицы, ТекстПустойТаблицы) Экспорт

	Результат = Новый Структура("Текст, Параметры", ТекстПустойТаблицы, Новый Структура);
	Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") ИЛИ Таблица.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	ВыбранныеПоля = Новый Массив;
	Для каждого Колонка Из Таблица.Колонки Цикл
		ВыбранныеПоля.Добавить(Колонка.Имя);
	КонецЦикла;
	
	НомерПараметра = 1;
	СтрокиВложенногоЗапроса = Новый Массив;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		КолонкиВложенногоЗапроса = Новый Массив;
		Для каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
			ИмяПеременной = "ЗначениеТЗ_" + Формат(НомерПараметра, "ЧН=; ЧГ=");
			Результат.Параметры.Вставить(ИмяПеременной, СтрокаТаблицы[ВыбранноеПоле]);
			КолонкиВложенногоЗапроса.Добавить("&" + ИмяПеременной + " КАК " + ВыбранноеПоле);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		СтрокиВложенногоЗапроса.Добавить(
		"ВЫБРАТЬ
		|	" + СтрСоединить(КолонкиВложенногоЗапроса, ",
		|	"));
	КонецЦикла;
	
	Результат.Текст = 
		"ВЫБРАТЬ
	|	" + СтрСоединить(ВыбранныеПоля, ", ") + "
	|ПОМЕСТИТЬ " + НазваниеВременнойТаблицы + "
	|ИЗ
	|(" + 
    СтрСоединить(СтрокиВложенногоЗапроса, "
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|") + ") КАК " + НазваниеВременнойТаблицы;
	
	Возврат Результат;
	
КонецФункции // ПолучитьВременнуюТаблицуИзТаблицыЗначений()

Функция ИмяПоставщика(Контрагент) Экспорт
	
	Если РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") Тогда
		Если ЗначениеЗаполнено(Контрагент.ПолнНаименование) Тогда 
			Имя = Контрагент.ПолнНаименование
		Иначе
			Имя = Контрагент.Наименование
		КонецЕсли;
	Иначе
		Имя = Контрагент.Псевдоним
	КонецЕсли;	
	Возврат СокрЛП(Имя);
	
КонецФункции

Процедура УстановитьПредставлениеКонтрагентаВЗапросе(ТекстЗапроса, ПодстрокаКонтрагент) Экспорт

	Если ОбщегоНазначенияПовтИсп.ДоступныНаименованияКонтрагентов() Тогда
		ПодстрокаЗамены = СтрШаблон("ВЫБОР КОГДА %1.ПолнНаименование = """" ТОГДА %1.Наименование ИНАЧЕ %1.ПолнНаименование КОНЕЦ", ПодстрокаКонтрагент);	
	Иначе
		ПодстрокаЗамены = СтрШаблон("%1.Псевдоним", ПодстрокаКонтрагент);	
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаКонтрагент, ПодстрокаЗамены);		

КонецПроцедуры

Функция Сейчас() Экспорт

	Возврат ТекущаяДатаСеанса();	

КонецФункции // Сейчас()

// Проверяет статус проведения переданных документов и возвращает
// те из них, которые не проведены.
//
// Параметры:
//  Документы - Массив из ДокументСсылка - документы, статус проведения которых необходимо проверить.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка - непроведенные документы.
//
Функция ПроверитьПроведенностьДокументов(Знач Документы) Экспорт
	
	Результат = Новый Массив;
	
	ШаблонЗапроса = 	
		"ВЫБРАТЬ
		|	ПсевдонимЗаданнойТаблицы.Ссылка КАК Ссылка
		|ИЗ
		|	&ИмяДокумента КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка В(&МассивДокументов)
		|	И НЕ ПсевдонимЗаданнойТаблицы.Проведен";
	
	ТекстОбъединитьВсе =
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
	ИменаДокументов = Новый Массив;
	Для Каждого Документ Из Документы Цикл
		МетаданныеДокумента = Документ.Метаданные();
		Если ИменаДокументов.Найти(МетаданныеДокумента.ПолноеИмя()) = Неопределено
			И Метаданные.Документы.Содержит(МетаданныеДокумента)
			И МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
				ИменаДокументов.Добавить(МетаданныеДокумента.ПолноеИмя());
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = "";
	Для Каждого ИмяДокумента Из ИменаДокументов Цикл
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + ТекстОбъединитьВсе;
		КонецЕсли;
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяДокумента", ИмяДокумента);
		ТекстЗапроса = ТекстЗапроса + ТекстПодзапроса;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", Документы);
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


#Область ПрикрепленныеФайлы

Функция СтрокаФайлов(ОбъектСсылка, НазначениеФайлов = Неопределено) Экспорт

	Результат = РегистрыСведений.ХранилищеФайлов.ПолучитьСтрокуФайлов(ОбъектСсылка, НазначениеФайлов);
	Если ПустаяСтрока(Результат) Тогда
		Результат = НСтр("ru = '(нет файлов)'; en = '(no files)'");
	КонецЕсли;
	Возврат Результат;	

КонецФункции // СтрокаФайлов()

Процедура ДобавитьВложенныйФайл(знач п_АдресВременногоХранилища, знач п_Объект, знач п_Файл, п_Отказ, п_ИзменитьСуществующуюЗапись=Ложь, п_КлючЗаписи="", ТекстСообщения="") Экспорт 
	
	Если НЕ ЗначениеЗаполнено(п_Объект) Тогда 
		п_Отказ = Истина; 
		//Если Вопрос("Инвойс еще не записан. Записать его и прикрепить файл?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да  Тогда
		//Если НЕ клДаНет("Инвойс еще не записан. Записать его и прикрепить файл?") Тогда
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;
	л_Дата = ТекущаяДата();	
	//л_НастройкаХраненияФайлов = РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее(л_Дата); 
	л_НастройкаХраненияФайлов = ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
	Если НЕ ЗначениеЗаполнено(п_Файл.Расширение) Тогда
	    ТекстСообщения = НСтр("ru = 'Нельзя прикреплять файл, не имеющий расширения!'; en = 'You cannot attach a file that does not have an extension!'");
		п_Отказ = Истина;  	
	КонецЕсли;

	НачатьТранзакцию();
	Если л_НастройкаХраненияФайлов.МестоХраненияФайлов = Перечисления.МестоХраненияПрикрепленныхФайлов.ОбщийДисковыйРесурс Тогда 
		Если п_Файл.Размер > л_НастройкаХраненияФайлов.МаксРазмерФайлаДляИБ Тогда 
			ТекстСообщения = ?(ТекстСообщения="", "", ТекстСообщения + Символы.ПС) + СтрШаблон(
							НСтр("ru = 'Размер файла: %1 Мбайт превышает максимальный размер, установленный в настройках (%2 Мбайт)'; en = 'File size: %1 Mb exceeds the maximum size in the settings (%2 Mb)'"), 
							Формат(п_Файл.Размер/(1024*1024), "ЧДЦ=1; ЧРГ="), 
							Формат(л_НастройкаХраненияФайлов.МаксРазмерФайлаДляИБ/(1024*1024), "ЧДЦ=1; ЧРГ="));
			п_Отказ = Истина;                
			УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		РегистрыСведений.ХранилищеФайлов.СохранитьФайлНаДиск(п_АдресВременногоХранилища, л_НастройкаХраненияФайлов, п_Объект, п_Файл, п_Отказ, ТекстСообщения);
		Если п_Отказ Тогда 
			УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ п_Отказ Тогда
		л_Запись = РегистрыСведений.ХранилищеФайлов.СоздатьМенеджерЗаписи();
		Если ТипЗнч(п_КлючЗаписи) = Тип("Структура") И п_КлючЗаписи.Свойство("ОбъектСсылка") И ЗначениеЗаполнено(п_КлючЗаписи.ОбъектСсылка) Тогда
			ЗаполнитьЗначенияСвойств(л_Запись, п_КлючЗаписи);
			л_Запись.Прочитать();
		КонецЕсли;
		РегистрыСведений.ХранилищеФайлов.ДобавитьЗаписьВРегистр(л_Дата, п_Объект, п_Файл, л_НастройкаХраненияФайлов, п_Отказ, п_ИзменитьСуществующуюЗапись, л_Запись, ТекстСообщения);
		Если п_Отказ Тогда 
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		п_КлючЗаписи = РегистрыСведений.ХранилищеФайлов.ПолучитьКлючЗаписи(п_Объект, п_Файл, л_НастройкаХраненияФайлов);
	КонецЕсли;
	УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
	ЗафиксироватьТранзакцию();  
	
КонецПроцедуры

Процедура СформироватьГиперссылкиФайловНаФорме(ОбъектСсылка, Форма, ГруппаЭлементовФормы, Назначение, ИмяПроцедурыПриНажатии, ИмяПроцедурыУдаления = "") Экспорт 
	
	Префикс = ?(Назначение=Перечисления.НазначениеФайлов.Прочее,"_П","_О");

	// удаление реквизитов и элементов   
	УдаляемыеЭлементы  = Новый Массив;
	УдаляемыеРевизиты = Новый Массив;
	Для каждого Эл Из ГруппаЭлементовФормы.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Эл);
		Если Найти(Эл.Имя, "ГруппаФайл") > 0 Тогда
			УдаляемыеРевизиты.Добавить(СтрЗаменить(Эл.Имя, "ГруппаФайл", "КартинкаФайл"));
		КонецЕсли;   
	КонецЦикла;
	Для каждого Эл Из УдаляемыеЭлементы Цикл
		Форма.Элементы.Удалить(Эл);
	КонецЦикла;
	Форма.ИзменитьРеквизиты( , УдаляемыеРевизиты);
	
	// добавление
	
	масФайлов = РегистрыСведений.ХранилищеФайлов.ПолучитьМассивФайлов(ОбъектСсылка, Назначение);
	
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	Для каждого Эл Из масФайлов Цикл
		//Создание реквизитов
		НовыйРеквизит = Новый РеквизитФормы("КартинкаФайл" + Префикс + масФайлов.Найти(Эл), Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(3,0))); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	КонецЦикла;
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); //Применяем реквизиты 
	
	Для каждого Эл Из масФайлов Цикл
     	Форма["КартинкаФайл" + Префикс + масФайлов.Найти(Эл)] = ОбщегоНазначения.ПолучитьИндексПиктограммыФайла(ОбщегоНазначения.ПолучитьРасширение(Эл));
	КонецЦикла;
	
	Если ИмяПроцедурыУдаления <> "" И масФайлов.ВГраница() > -1 Тогда
		Если Форма.Команды.Найти("УдалениеФайлаВложения") = Неопределено Тогда
			НоваяКомандаУдаления = Форма.Команды.Добавить("УдалениеФайлаВложения");
			НоваяКомандаУдаления.Действие = ИмяПроцедурыУдаления;		
		КонецЕсли;
	КонецЕсли;    
	
	Если масФайлов.ВГраница() = -1 Тогда
		НовыйЭлементБ = Форма.Элементы.Добавить("БезФайлов" + Префикс, Тип("ДекорацияФормы"), ГруппаЭлементовФормы);
		НовыйЭлементБ.Вид 					= ВидДекорацииФормы.Надпись; 
		НовыйЭлементБ.Заголовок 			= НСтр("ru = '(нет файлов)'; en = '(no files)'");
		НовыйЭлементБ.ЦветТекста			= ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли;

	Для каждого Эл Из масФайлов Цикл
		
		ИмяЭлемента = Префикс + масФайлов.Найти(Эл);
		
		НовГруппа = Форма.Элементы.Добавить("ГруппаФайл" + ИмяЭлемента, Тип("ГруппаФормы"), ГруппаЭлементовФормы); 
		НовГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа; 
		НовГруппа.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		НовГруппа.Отображение 				= ОтображениеОбычнойГруппы.Нет;
		НовГруппа.ОтображатьЗаголовок 		= Ложь;
		
		НовыйЗначок = Форма.Элементы.Добавить("Картинка" + ИмяЭлемента, Тип("ПолеФормы"), НовГруппа);
		НовыйЗначок.Вид 					= ВидПоляФормы.ПолеКартинки; 
		НовыйЗначок.ПутьКДанным 			= "КартинкаФайл" + ИмяЭлемента;
		НовыйЗначок.КартинкаЗначений 		= БиблиотекаКартинок.КоллекцияПиктограммФайлов;
		НовыйЗначок.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.нет;
		НовыйЗначок.Ширина 					= 2;
		НовыйЗначок.Высота 					= 1;  
		НовыйЗначок.ВертикальноеПоложение 	= ВертикальноеПоложениеЭлемента.Верх;  
		НовыйЗначок.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх; 
        НовыйЗначок.РастягиватьПоГоризонтали = Ложь;    
		НовыйЗначок.РастягиватьПоВертикали 	= Ложь;
		НовыйЗначок.Рамка 					= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, ); 
		//НовыйЗначок.КонтекстноеМеню.Доступность = Ложь;
		//НовыйЗначок.КонтекстноеМеню.Видимость = Ложь;
		Если ИмяПроцедурыУдаления <> "" Тогда
			НовыйЗначок.Гиперссылка 		= Истина;
			НовыйЗначок.УстановитьДействие("Нажатие", ИмяПроцедурыУдаления);
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Добавить("Файл" + ИмяЭлемента, Тип("ДекорацияФормы"), НовГруппа);
		НовыйЭлемент.Вид 					= ВидДекорацииФормы.Надпись; 
		НовыйЭлемент.Гиперссылка 			= Истина;
		НовыйЭлемент.Заголовок 				= Эл;	
		НовыйЭлемент.УстановитьДействие("Нажатие", ИмяПроцедурыПриНажатии);
		
		Если ИмяПроцедурыУдаления <> "" Тогда
			НовыйЭлементП = Форма.Элементы.Добавить("Пробел" + ИмяЭлемента, Тип("ДекорацияФормы"), НовГруппа);
			НовыйЭлементП.Вид 				= ВидДекорацииФормы.Картинка; 
			НовыйЭлементП.Ширина 			= 1;
			НовыйЭлементП.Высота 			= 1;  
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти             


 #Область ЗагрузкаИзЭкселя
 
 Процедура ИмпортЭкселяВТабЧасть(АдресФайла, ТабЧасть, Настройки, ЗаполнятьПартию = Истина, ЗаполнятьНоменклатуру = Истина) Экспорт 
	
    Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
        ИмяВремФайла = ПолучитьИмяВременногоФайла("xlsx");
        ДвоичныеДанные.Записать(ИмяВремФайла);
        табДок = Новый ТабличныйДокумент;
        
        Попытка
            табДок.Прочитать(ИмяВремФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
            Возврат;
        КонецПопытки;
        фЧитаем = Истина;
        СЧ = 2;
        Пока фЧитаем Цикл         
			
			//НовСтрока = ТабЧасть.Добавить();
			//Для каждого Настр Из Настройки Цикл 
			//	Значение = Строка(табДок.ПолучитьОбласть("R"+Строка(СЧ)+"C1:R"+Строка(СЧ)+"C1").ТекущаяОбласть.Текст);	
			//	
			//	НовСтрока[Настр.ИмяПоля] = 
			//	
			//
			//КонецЦикла;
			
			
            Попытка
				//сК    = Строка(табДок.ПолучитьОбласть("R"+Строка(СЧ)+"C1:R"+Строка(СЧ)+"C1").ТекущаяОбласть.Текст);
				//сО    = Строка(табДок.ПолучитьОбласть("R"+Строка(СЧ)+"C2:R"+Строка(СЧ)+"C2").ТекущаяОбласть.Текст);
				//сП    = Строка(табДок.ПолучитьОбласть("R" + СЧ + "C3:R" + СЧ + "C3").ТекущаяОбласть.Текст);
				//сЦ    = Строка(табДок.ПолучитьОбласть("R" + СЧ + "C4:R" + СЧ + "C4").ТекущаяОбласть.Текст);
				//сР    = Строка(табДок.ПолучитьОбласть("R" + СЧ + "C5:R" + СЧ + "C5").ТекущаяОбласть.Текст);
				//сС = Строка(табДок.ПолучитьОбласть("R" + СЧ + "C6:R" + СЧ + "C6").ТекущаяОбласть.Текст);
				//сТе    = Строка(табДок.ПолучитьОбласть("R" + СЧ + "C7:R" + СЧ + "C7").ТекущаяОбласть.Текст);
				//Если ПустаяСтрока(сК + сО + сП + сЦ + сР + сС + сТ) Тогда
				//    фЧитаем = Ложь;
				//Иначе
				//    об = Справочники.Материалы.НайтиПоНаименованию(сОборудование, Истина);
				//    Если об = Справочники.Материалы.ПустаяСсылка() Тогда
				//        
				//        нс = Справочники.Материалы.СоздатьЭлемент(); 
				//        нс.Наименование = сОборудование;    
				//    Иначе
				//        нс = об.ПолучитьОбъект();
				//    КонецЕсли;
				//    
				//    
				//    нс.Производитель = сПроизводитель;
				//    нс.Стоимость = сЦена;
				//    нс.Разрешение = сРазрешение;
				//    нс.СветовойПоток = сСветовойПоток;
				//    нс.ТипОборудования = ?(сКатегории = "Проекторы", Перечисления.ТипОборудования.Проектор, Перечисления.ТипОборудования.ИнтерактивнаяДоска);
				//    нс.Записать();
				//КонецЕсли;
            Исключение
                Сообщение        = Новый СообщениеПользователю;
                Сообщение.Текст   = "Не удалось загрузить строку " + Строка(сч) + ОписаниеОшибки();
                Сообщение.Сообщить();
            КонецПопытки;
            СЧ = СЧ + 1;
        КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

 #КонецОбласти            
 
 
//Процедура ПроверитьВозможностьРедактированияПоДатеДокумента(ДокументОбъект, ФормаДокумента) Экспорт

//	Если ПараметрыСеанса.ДатаЗапретаРедактирования <> Дата(1,1,1) И  ДокументОбъект.Дата < ПараметрыСеанса.ДатаЗапретаРедактирования Тогда
//		Сообщить(НСтр("ru = 'Период закрыт. Только просмотр'; en = 'Period is closed. Read only'"), СтатусСообщения.Внимание);
//		ФормаДокумента.ТолькоПросмотр = Истина;  
//		//ФормаДокумента.Элементы.СостояниеДокумента.Заголовок = ФормаДокумента.Элементы.СостояниеДокумента.Заголовок + НСтр("ru = ', только просмотр'; en = ', read only'");
//		масРеквизитов = ФормаДокумента.ПолучитьРеквизиты();
//		Для каждого элРеквизит Из масРеквизитов Цикл
//			Если элРеквизит.Имя = "КэшДанных" Тогда
//				ФормаДокумента.КэшДанных.Вставить("ПериодЗакрыт", Истина);
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;	

//КонецПроцедуры

Функция ДолгиПокупателя(Контрагент, Дата) Экспорт

	Если Контрагент.ОтсрочкаДней = 0 Тогда
		Возврат 0;
	Иначе	
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	ДолгиОстатки.ДолгПокупателяОстаток КАК Сумма,
		             |	ДолгиОстатки.Док КАК Док,
		             |	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДолгиОстатки.Док.Дата, ДЕНЬ, &Отсрочка), &Дата, ДЕНЬ) КАК Срок,
		             |	ДолгиОстатки.Валюта КАК Валюта
		             |ИЗ
		             |	РегистрНакопления.Долги.Остатки(&Дата, Контрагент = &Контрагент) КАК ДолгиОстатки
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	ДолгиОстатки.Док.Дата";
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Контрагент", Контрагент);
		Запр.УстановитьПараметр("Отсрочка", Контрагент.ОтсрочкаДней);
	    РезультатЗапроса = Запр.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат 0;
		Иначе
			мас = Новый Массив;
		    Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				мас.Добавить(Новый Структура("Сумма,Документ,Валюта,Срок", Выборка.Сумма, Выборка.Док, Выборка.Валюта, Выборка.Срок));	
			КонецЦикла;	
			Возврат Новый Структура("Срок, Долги", Мас[0].Срок, Мас);
		КонецЕсли;
	КонецЕсли;	

КонецФункции // ДолгПокупателя()

Функция ДолгиПоставщику(Контрагент, Дата = Неопределено) Экспорт
	
	Долги = Новый Массив;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Дата", Дата);
	Запр.УстановитьПараметр("Контрагент", Контрагент);
	Запр.Текст = "ВЫБРАТЬ
	             |	ВзаиморасчетыОстатки.Валюта КАК Валюта,
	             |	ВзаиморасчетыОстатки.СуммаОплатыОстаток КАК Сумма
	             |ИЗ
	             |	РегистрНакопления._ВзаиморасчетыСПоставщиками.Остатки({(&Дата)}, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";	
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Долги.Добавить(Новый Структура("Валюта,Сумма", Выборка.Валюта, Выборка.Сумма));	
	Конеццикла;
	Возврат Долги;
	
КонецФункции // ДолгПоставщику()

Функция ДолгиПоставщикуПоИнвойсам(Контрагент, Дата = Неопределено) Экспорт

	ПоИнвойсам = Новый Массив;
	ПоВалютам = Новый Массив;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Дата", Дата);
	Запр.УстановитьПараметр("Контрагент", Контрагент);
	Запр.Текст = "ВЫБРАТЬ
	             |	РасчетыПоИнвойсамОстатки.Инвойс КАК Инвойс,
	             |	РасчетыПоИнвойсамОстатки.Валюта КАК Валюта,
	             |	СУММА(РасчетыПоИнвойсамОстатки.СуммаОстаток) КАК Сумма,
	             |	СостоянияИнвойсов.СтатусОплатыАвто КАК СтатусОплатыАвто
	             |ПОМЕСТИТЬ тз
	             |ИЗ
	             |	РегистрНакопления.РасчетыПоИнвойсам.Остатки({(&Дата)}, Контрагент = &Контрагент) КАК РасчетыПоИнвойсамОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО РасчетыПоИнвойсамОстатки.Инвойс = СостоянияИнвойсов.Инвойс
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасчетыПоИнвойсамОстатки.Инвойс,
	             |	РасчетыПоИнвойсамОстатки.Валюта,
	             |	СостоянияИнвойсов.СтатусОплатыАвто
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тз.Инвойс КАК Инвойс,
	             |	тз.Валюта КАК Валюта,
	             |	тз.Сумма КАК Сумма,
	             |	тз.СтатусОплатыАвто КАК СтатусОплатыАвто
	             |ИЗ
	             |	тз КАК тз
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тз.Валюта КАК Валюта,
	             |	СУММА(тз.Сумма) КАК Сумма
	             |ИЗ
	             |	тз КАК тз
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	тз.Валюта";	 
	Запр.Текст = "ВЫБРАТЬ
	             |	База.Инвойс КАК Инвойс,
	             |	База.Валюта КАК Валюта,
	             |	СУММА(База.Сумма) КАК Сумма,
	             |	МАКСИМУМ(База.СтатусОплатыАвто) КАК СтатусОплатыАвто
	             |ПОМЕСТИТЬ тз
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Остатки.Инвойс КАК Инвойс,
	             |		Остатки.Валюта КАК Валюта,
	             |		Остатки.СуммаОстаток КАК Сумма,
	             |		NULL КАК СтатусОплатыАвто
	             |	ИЗ
	             |		РегистрНакопления.РасчетыПоИнвойсам.Остатки({(&Дата)}, Контрагент = &Контрагент) КАК Остатки
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		Состояния.Инвойс,
	             |		Состояния.Инвойс.Валюта,
	             |		0,
	             |		Состояния.СтатусОплатыАвто
	             |	ИЗ
	             |		РегистрСведений.СостоянияИнвойсов КАК Состояния
	             |	ГДЕ
	             |		Состояния.Инвойс.Контрагент = &Контрагент) КАК База
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	База.Инвойс,
	             |	База.Валюта
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тз.Инвойс КАК Инвойс,
	             |	тз.Валюта КАК Валюта,
	             |	тз.Сумма КАК Сумма,
	             |	тз.СтатусОплатыАвто КАК СтатусОплатыАвто
	             |ИЗ
	             |	тз КАК тз
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	тз.Валюта КАК Валюта,
	             |	СУММА(тз.Сумма) КАК Сумма
	             |ИЗ
	             |	тз КАК тз
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	тз.Валюта";	 
	Пакет = Запр.ВыполнитьПакет();
	ВыборкаИнвойсы = Пакет[1].Выбрать();
	Пока ВыборкаИнвойсы.Следующий() Цикл
		ПоИнвойсам.Добавить(Новый Структура("Инвойс,Валюта,Сумма,СтатусОплатыАвто", ВыборкаИнвойсы.Инвойс, ВыборкаИнвойсы.Валюта, ВыборкаИнвойсы.Сумма, ВыборкаИнвойсы.СтатусОплатыАвто));	
	КонецЦикла; 
	ВыборкаВалюты = Пакет[2].Выбрать();
	Пока ВыборкаВалюты.Следующий() Цикл
		ПоВалютам.Добавить(Новый Структура("Валюта,Сумма", ВыборкаВалюты.Валюта, ВыборкаВалюты.Сумма));
	КонецЦикла;	
	Возврат Новый Структура("ПоИнвойсам,ПоВалютам", ПоИнвойсам, ПоВалютам);	

КонецФункции 

#Область ПодключаемыеКоманды

Процедура ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм) Экспорт

	Элементы = ПараметрыРазмещения.Форма.Элементы;
	КоманднаяПанель = ПараметрыРазмещения.КоманднаяПанель;
	Если КоманднаяПанель = Неопределено Тогда
		КоманднаяПанель = Элементы.Найти("ПодключаемыеКоманды");
		Если КоманднаяПанель = Неопределено Тогда
			КоманднаяПанель = Элементы.Найти("КоманднаяПанель");
			
			Если Не ПараметрыРазмещения.ЭтоФормаОбъекта
				И КоманднаяПанель = Неопределено  Тогда
				ТаблицаФормы = Элементы.Найти("Список");
				Если ТипЗнч(ТаблицаФормы) = Тип("ТаблицаФормы")
					И ТаблицаФормы.ПоложениеКоманднойПанели <> ПоложениеКоманднойПанелиЭлементаФормы.Нет Тогда
					КоманднаяПанель = ТаблицаФормы.КоманднаяПанель;
				КонецЕсли;
			КонецЕсли;
			Если КоманднаяПанель = Неопределено Тогда
				КоманднаяПанель = ПараметрыРазмещения.Форма.КоманднаяПанель;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	КоманднаяПанель.Подсказка = НСтр("ru = 'Печать'; en = 'Print'");
	
	Если СтруктураПечатныхФорм.Количество() > 1 Тогда
		Подменю = Элементы.Добавить("МенюПечать", Тип("ГруппаФормы"), КоманднаяПанель);
		Подменю.Вид         = ВидГруппыФормы.Подменю;
		Подменю.Заголовок   = НСтр("ru = 'Печать'; en = 'Print'");
		Подменю.Картинка    = БиблиотекаКартинок.Печать;
	Иначе
		Подменю = КоманднаяПанель;  
	КонецЕсли;
	
	Для каждого ОписаниеПечФормы Из СтруктураПечатныхФорм Цикл  
		ИмяКоманды = "ПодключеннаяПечать_" + ОписаниеПечФормы.Ключ;
		НоваяКоманда = ПараметрыРазмещения.Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "ВыполнитьПодключеннуюПечать";   //Имя процедуры на клиенте
		НовыйЭлемент = Элементы.Добавить("Печать_"+ОписаниеПечФормы.Ключ, Тип("КнопкаФормы"), Подменю);
		НовыйЭлемент.Заголовок = ОписаниеПечФормы.Значение;
		НовыйЭлемент.ИмяКоманды = ИмяКоманды; 
		Если СтруктураПечатныхФорм.Количество() = 1 Тогда
			НовыйЭлемент.Картинка = БиблиотекаКартинок.Печать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти    

Функция СтатусПроведения(ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		Если ДокументСсылка.Проведен Тогда
			Возврат 0;
		ИначеЕсли ДокументСсылка.ПометкаУдаления Тогда
			Возврат 2;
		Иначе
			Возврат 1;
		КонецЕсли;
	Иначе	
		Возврат 3;
	КонецЕсли;
	
КонецФункции // СтатусПроведения()

// © Primus1C  ОКОНЧАНИЕ ◄
